ondiiik/micropython-esp32-cam/ports/esp32/esp32-camera/driver/camera.c
    MP_LOGI(TAG, "Allocating %u frame buffers (%d KB total)", count, (s_state->fb_size * count) / 1024);
    
    struct campy_FrameBuffer* _fb  = NULL;
    struct campy_FrameBuffer* _fb1 = NULL;
    struct campy_FrameBuffer* _fb2 = NULL;
    
    for (size_t i = 0; i < count; i++)
    {
        _fb2 = (struct campy_FrameBuffer*)m_malloc0(sizeof(struct campy_FrameBuffer));
        
        if (NULL == _fb2)
        {
            goto fail;
        }
        
        _fb2->size = s_state->fb_size;
        _fb2->buf  = (uint8_t*)m_malloc0(_fb2->size);
        
        if (NULL == _fb2->buf)
        {
            m_free(_fb2);
            MP_LOGE(TAG, "Allocating %d KB frame buffer Failed", s_state->fb_size / 1024);
            goto fail;
        }
        
        _fb2->next = _fb;
        _fb        = _fb2;
        
        if (0 == i)
        {
            _fb1 = _fb2;
        }
    }
    
    if (NULL != _fb1)
    {
        _fb1->next = _fb;
    }
    
    s_state->fb = _fb;//load first buffer
    
    return ESP_OK;
    
fail:
    while (_fb)
    {
        _fb2 = _fb;
        _fb = _fb->next;
        m_free(_fb2->buf);
        m_free(_fb2);
    }
    return ESP_ERR_NO_MEM;
}

static esp_err_t dma_desc_init()
{
    assert(s_state->width % 4 == 0);
    size_t line_size = s_state->width * s_state->in_bytes_per_pixel * i2s_bytes_per_sample(s_state->sampling_mode);
    MP_LOGD(TAG, "Line width (for DMA): %d bytes", line_size);
    
    size_t dma_per_line = 1;
    size_t buf_size     = line_size;
    
    while (buf_size >= 4096)
    {
        buf_size     /= 2;
        dma_per_line *= 2;
    }
    
    size_t dma_desc_count   = dma_per_line * 4;
    s_state->dma_buf_width  = line_size;
    s_state->dma_per_line   = dma_per_line;
    s_state->dma_desc_count = dma_desc_count;
    MP_LOGD(TAG, "DMA buffer size: %d, DMA buffers per line: %d", buf_size, dma_per_line);
    MP_LOGD(TAG, "DMA buffer count: %d", dma_desc_count);
    MP_LOGD(TAG, "DMA buffer total: %d bytes", buf_size * dma_desc_count);
    
    s_state->dma_buf = (dma_elem_t**)malloc(sizeof(dma_elem_t*) * dma_desc_count);
    
    if (s_state->dma_buf == NULL)
    {
        return ESP_ERR_NO_MEM;
    }
    
    s_state->dma_desc = (lldesc_t*) malloc(sizeof(lldesc_t) * dma_desc_count);
    
    if (s_state->dma_desc == NULL)
    {
        return ESP_ERR_NO_MEM;
    }
    
    size_t dma_sample_count = 0;
    
    for (int i = 0; i < dma_desc_count; ++i)
    {
        MP_LOGD(TAG, "Allocating DMA buffer #%d, size=%d", i, buf_size);
        
        dma_elem_t* buf = (dma_elem_t*) malloc(buf_size);
        
        if (buf == NULL)
        {
            return ESP_ERR_NO_MEM;
        }
        
        s_state->dma_buf[i] = buf;
        MP_LOGV(TAG, "dma_buf[%d]=%p", i, buf);
        
        lldesc_t* pd = &s_state->dma_desc[i];
        pd->length   = buf_size;
        
        if ((s_state->sampling_mode == SM_0A0B_0B0C) && (i + 1) % dma_per_line == 0)
        {
            pd->length -= 4;
        }
        
        dma_sample_count += pd->length / 4;
        
        pd->size         = pd->length;
        pd->owner        = 1;
        pd->sosf         = 1;
        pd->buf          = (uint8_t*) buf;
        pd->offset       = 0;
        pd->empty        = 0;
        pd->eof          = 1;
        pd->qe.stqe_next = &s_state->dma_desc[(i + 1) % dma_desc_count];
    }
    
    s_state->dma_sample_count = dma_sample_count;
    return ESP_OK;
}

static void dma_desc_deinit()
{
    if (s_state->dma_buf)
    {
        for (int i = 0; i < s_state->dma_desc_count; ++i)
        {
            free(s_state->dma_buf[i]);
        }
    }
    free(s_state->dma_buf);
    free(s_state->dma_desc);
}

static inline void IRAM_ATTR i2s_conf_reset()
{
    const uint32_t lc_conf_reset_flags = I2S_IN_RST_M | I2S_AHBM_RST_M
                                         | I2S_AHBM_FIFO_RST_M;
    I2S0.lc_conf.val |= lc_conf_reset_flags;
    I2S0.lc_conf.val &= ~lc_conf_reset_flags;
    
    const uint32_t conf_reset_flags = I2S_RX_RESET_M | I2S_RX_FIFO_RESET_M
                                      | I2S_TX_RESET_M | I2S_TX_FIFO_RESET_M;
    I2S0.conf.val |= conf_reset_flags;
    I2S0.conf.val &= ~conf_reset_flags;
    while (I2S0.state.rx_fifo_reset_back)
    {
        ;
    }
}

static void i2s_init()
{
    camera_config_t* config = &s_state->config;
    
    // Configure input GPIOs
    gpio_num_t pins[] =
    {
        config->pin_d7,
        config->pin_d6,
        config->pin_d5,
        config->pin_d4,
        config->pin_d3,
        config->pin_d2,
        config->pin_d1,
        config->pin_d0,
        config->pin_vsync,
        config->pin_href,
        config->pin_pclk
    };
    gpio_config_t conf =
    {
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    for (int i = 0; i < sizeof(pins) / sizeof(gpio_num_t); ++i)
    {
        if (rtc_gpio_is_valid_gpio(pins[i]))
        {
            rtc_gpio_deinit(pins[i]);
        }
        conf.pin_bit_mask = 1LL << pins[i];
        gpio_config(&conf);
    }
    
    // Route input GPIOs to I2S peripheral using GPIO matrix
    gpio_matrix_in(config->pin_d0, I2S0I_DATA_IN0_IDX, false);
    gpio_matrix_in(config->pin_d1, I2S0I_DATA_IN1_IDX, false);
    gpio_matrix_in(config->pin_d2, I2S0I_DATA_IN2_IDX, false);
    gpio_matrix_in(config->pin_d3, I2S0I_DATA_IN3_IDX, false);
    gpio_matrix_in(config->pin_d4, I2S0I_DATA_IN4_IDX, false);
    gpio_matrix_in(config->pin_d5, I2S0I_DATA_IN5_IDX, false);
    gpio_matrix_in(config->pin_d6, I2S0I_DATA_IN6_IDX, false);
    gpio_matrix_in(config->pin_d7, I2S0I_DATA_IN7_IDX, false);
    gpio_matrix_in(config->pin_vsync, I2S0I_V_SYNC_IDX, false);
    gpio_matrix_in(0x38, I2S0I_H_SYNC_IDX, false);
    gpio_matrix_in(config->pin_href, I2S0I_H_ENABLE_IDX, false);
    gpio_matrix_in(config->pin_pclk, I2S0I_WS_IN_IDX, false);
    
    // Enable and configure I2S peripheral
    periph_module_enable(PERIPH_I2S0_MODULE);
    // Toggle some reset bits in LC_CONF register
    // Toggle some reset bits in CONF register
    i2s_conf_reset();
    // Enable slave mode (sampling clock is external)
    I2S0.conf.rx_slave_mod = 1;
    // Enable parallel mode
    I2S0.conf2.lcd_en = 1;
    // Use HSYNC/VSYNC/HREF to control sampling
    I2S0.conf2.camera_en = 1;
    // Configure clock divider
    I2S0.clkm_conf.clkm_div_a = 1;
    I2S0.clkm_conf.clkm_div_b = 0;
    I2S0.clkm_conf.clkm_div_num = 2;
    // FIFO will sink data to DMA
    I2S0.fifo_conf.dscr_en = 1;
    // FIFO configuration
    I2S0.fifo_conf.rx_fifo_mod = s_state->sampling_mode;
    I2S0.fifo_conf.rx_fifo_mod_force_en = 1;
    I2S0.conf_chan.rx_chan_mod = 1;
    // Clear flags which are used in I2S serial mode
    I2S0.sample_rate_conf.rx_bits_mod = 0;
    I2S0.conf.rx_right_first = 0;
    I2S0.conf.rx_msb_right = 0;
    I2S0.conf.rx_msb_shift = 0;
    I2S0.conf.rx_mono = 0;
    I2S0.conf.rx_short_sync = 0;
    I2S0.timing.val = 0;
    I2S0.timing.rx_dsync_sw = 1;
    
    // Allocate I2S interrupt, keep it disabled
    ESP_ERROR_CHECK(esp_intr_alloc(ETS_I2S0_INTR_SOURCE,
                                   ESP_INTR_FLAG_INTRDISABLED | ESP_INTR_FLAG_LOWMED | ESP_INTR_FLAG_IRAM,
                                   &i2s_isr, NULL, &s_state->i2s_intr_handle));
}

static void IRAM_ATTR i2s_start_bus()
{
    s_state->dma_desc_cur = 0;
    s_state->dma_received_count = 0;
    //s_state->dma_filtered_count = 0;
    esp_intr_disable(s_state->i2s_intr_handle);
    i2s_conf_reset();
    
    I2S0.rx_eof_num = s_state->dma_sample_count;
    I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[0];
    I2S0.in_link.start = 1;
    I2S0.int_clr.val = I2S0.int_raw.val;
    I2S0.int_ena.val = 0;
    I2S0.int_ena.in_done = 1;
    
    esp_intr_enable(s_state->i2s_intr_handle);
    I2S0.conf.rx_start = 1;
    if (s_state->config.pixel_format == PIXFORMAT_JPEG)
    {
        vsync_intr_enable();
    }
}

static int i2s_run()
{
    for (int i = 0; i < s_state->dma_desc_count; ++i)
    {
        lldesc_t* d = &s_state->dma_desc[i];
        MP_LOGV(TAG, "DMA desc %2d: %u %u %u %u %u %u %p %p",
                 i, d->length, d->size, d->offset, d->eof, d->sosf, d->owner, d->buf, d->qe.stqe_next);
        memset(s_state->dma_buf[i], 0, d->length);
    }
    
    struct campy_FrameBuffer* fb = s_state->fb;
    
