ondiiik/micropython-esp32-cam/ports/esp32/esp32-camera/driver/camera.c
    while (s_state->config.fb_count > 1)
    {
        while ((s_state->fb->ref) &&
               (s_state->fb->next != fb))
        {
            s_state->fb = s_state->fb->next;
        }
        
        if (s_state->fb->ref == 0)
        {
            break;
        }
        
        vTaskDelay(2);
    }
    
    //todo: wait for vsync
    MP_LOGV(TAG, "Waiting for negative edge on VSYNC");
    
    int64_t st_t = esp_timer_get_time();
    while (_gpio_get_level(s_state->config.pin_vsync) != 0)
    {
        if ((esp_timer_get_time() - st_t) > 1000000LL)
        {
            MP_LOGE(TAG, "Timeout waiting for VSYNC");
            return -1;
        }
    }
    MP_LOGV(TAG, "Got VSYNC");
    i2s_start_bus();
    return 0;
}

static void IRAM_ATTR i2s_stop_bus()
{
    esp_intr_disable(s_state->i2s_intr_handle);
    vsync_intr_disable();
    i2s_conf_reset();
    I2S0.conf.rx_start = 0;
}

static void IRAM_ATTR i2s_stop(bool* need_yield)
{
    if (s_state->config.fb_count == 1 && !s_state->fb->bad)
    {
        i2s_stop_bus();
    }
    else
    {
        s_state->dma_received_count = 0;
    }
    
    size_t val = SIZE_MAX;
    BaseType_t higher_priority_task_woken;
    BaseType_t ret = xQueueSendFromISR(s_state->data_ready, &val, &higher_priority_task_woken);
    if (need_yield && !*need_yield)
    {
        *need_yield = (ret == pdTRUE && higher_priority_task_woken == pdTRUE);
    }
}

static void IRAM_ATTR signal_dma_buf_received(bool* need_yield)
{
    size_t dma_desc_filled = s_state->dma_desc_cur;
    s_state->dma_desc_cur = (dma_desc_filled + 1) % s_state->dma_desc_count;
    s_state->dma_received_count++;
    if (!s_state->fb->ref && s_state->fb->bad)
    {
        *need_yield = false;
        return;
    }
    BaseType_t higher_priority_task_woken;
    BaseType_t ret = xQueueSendFromISR(s_state->data_ready, &dma_desc_filled, &higher_priority_task_woken);
    if (ret != pdTRUE)
    {
        if (!s_state->fb->ref)
        {
            s_state->fb->bad = 1;
        }
        //ESP_EARLY_LOGW(TAG, "qsf:%d", s_state->dma_received_count);
        //ets_printf("qsf:%d\n", s_state->dma_received_count);
        //ets_printf("qovf\n");
    }
    *need_yield = (ret == pdTRUE && higher_priority_task_woken == pdTRUE);
}

static void IRAM_ATTR i2s_isr(void* arg)
{
    I2S0.int_clr.val = I2S0.int_raw.val;
    bool need_yield = false;
    signal_dma_buf_received(&need_yield);
    if (s_state->config.pixel_format != PIXFORMAT_JPEG
        && s_state->dma_received_count == s_state->height * s_state->dma_per_line)
    {
        i2s_stop(&need_yield);
    }
    if (need_yield)
    {
        portYIELD_FROM_ISR();
    }
}

static void IRAM_ATTR vsync_isr(void* arg)
{
    GPIO.status1_w1tc.val = GPIO.status1.val;
    GPIO.status_w1tc = GPIO.status;
    bool need_yield = false;
    //if vsync is low and we have received some data, frame is done
    if (_gpio_get_level(s_state->config.pin_vsync) == 0)
    {
        if (s_state->dma_received_count > 0)
        {
            signal_dma_buf_received(&need_yield);
            //ets_printf("end_vsync\n");
            if (s_state->dma_filtered_count > 1 || s_state->fb->bad || s_state->config.fb_count > 1)
            {
                i2s_stop(&need_yield);
            }
            //ets_printf("vs\n");
        }
        if (s_state->config.fb_count > 1 || s_state->dma_filtered_count < 2)
        {
            I2S0.conf.rx_start = 0;
            I2S0.in_link.start = 0;
            I2S0.int_clr.val = I2S0.int_raw.val;
            i2s_conf_reset();
            s_state->dma_desc_cur = (s_state->dma_desc_cur + 1) % s_state->dma_desc_count;
            //I2S0.rx_eof_num = s_state->dma_sample_count;
            I2S0.in_link.addr = (uint32_t) &s_state->dma_desc[s_state->dma_desc_cur];
            I2S0.in_link.start = 1;
            I2S0.conf.rx_start = 1;
            s_state->dma_received_count = 0;
        }
    }
    if (need_yield)
    {
        portYIELD_FROM_ISR();
    }
}

static void IRAM_ATTR camera_fb_done()
{
    struct campy_FrameBuffer* fb         = NULL;
    struct campy_FrameBuffer* fb2        = NULL;
    BaseType_t                taskAwoken = 0;
    
    if (s_state->config.fb_count == 1)
    {
        xSemaphoreGive(s_state->frame_ready);
        return;
    }
    
    fb = s_state->fb;
    
    if (!fb->ref && fb->len)
    {
        //add reference
        fb->ref = 1;
        
        //check if the queue is full
        if (xQueueIsQueueFullFromISR(s_state->fb_out) == pdTRUE)
        {
            //pop frame buffer from the queue
            if (xQueueReceiveFromISR(s_state->fb_out, &fb2, &taskAwoken) == pdTRUE)
            {
                //free the popped buffer
                fb2->ref = 0;
                fb2->len = 0;
                //push the new frame to the end of the queue
                xQueueSendFromISR(s_state->fb_out, &fb, &taskAwoken);
            }
            else
            {
                //queue is full and we could not pop a frame from it
            }
        }
        else
        {
            //push the new frame to the end of the queue
            xQueueSendFromISR(s_state->fb_out, &fb, &taskAwoken);
        }
    }
    else
    {
        //frame was referenced or empty
    }
    
    //return buffers to be filled
    while (xQueueReceiveFromISR(s_state->fb_in, &fb2, &taskAwoken) == pdTRUE)
    {
        fb2->ref = 0;
        fb2->len = 0;
    }
    
    //advance frame buffer only if the current one has data
    if (s_state->fb->len)
    {
        s_state->fb = s_state->fb->next;
    }
    //try to find the next free frame buffer
    while (s_state->fb->ref && s_state->fb->next != fb)
    {
        s_state->fb = s_state->fb->next;
    }
    
    //is the found frame buffer free?
    if (!s_state->fb->ref)
    {
        //buffer found. make sure it's empty
        s_state->fb->len = 0;
        *((uint32_t*)s_state->fb->buf) = 0;
    }
    else
    {
        //stay at the previous buffer
        s_state->fb = fb;
    }
}

static void IRAM_ATTR dma_finish_frame()
{
    size_t buf_len = s_state->width * s_state->fb_bytes_per_pixel / s_state->dma_per_line;
    
    if (!s_state->fb->ref)
    {
        // is the frame bad?
        if (s_state->fb->bad)
        {
            s_state->fb->bad = 0;
            s_state->fb->len = 0;
            *((uint32_t*)s_state->fb->buf) = 0;
            if (s_state->config.fb_count == 1)
            {
                i2s_start_bus();
            }
            //ets_printf("bad\n");
        }
        else
        {
            s_state->fb->len = s_state->dma_filtered_count * buf_len;
            if (s_state->fb->len)
            {
                //find the end marker for JPEG. Data after that can be discarded
                if (s_state->fb->format == PIXFORMAT_JPEG)
                {
                    uint8_t* dptr = &s_state->fb->buf[s_state->fb->len - 1];
                    while (dptr > s_state->fb->buf)
                    {
                        if (dptr[0] == 0xFF && dptr[1] == 0xD9 && dptr[2] == 0x00 && dptr[3] == 0x00)
                        {
                            dptr += 2;
                            s_state->fb->len = dptr - s_state->fb->buf;
                            if ((s_state->fb->len & 0x1FF) == 0)
                            {
                                s_state->fb->len += 1;
                            }
                            if ((s_state->fb->len % 100) == 0)
                            {
                                s_state->fb->len += 1;
                            }
                            break;
                        }
                        dptr--;
                    }
                }
                //send out the frame
                camera_fb_done();
            }
            else if (s_state->config.fb_count == 1)
            {
                //frame was empty?
                i2s_start_bus();
            }
            else
            {
                //ets_printf("empty\n");
            }
        }
    }
    else if (s_state->fb->len)
    {
        camera_fb_done();
    }
    s_state->dma_filtered_count = 0;
}

static void IRAM_ATTR dma_filter_buffer(size_t buf_idx)
{
    //no need to process the data if frame is in use or is bad
    if (s_state->fb->ref || s_state->fb->bad)
    {
        return;
    }
    
    //check if there is enough space in the frame buffer for the new data
    size_t buf_len = s_state->width * s_state->fb_bytes_per_pixel / s_state->dma_per_line;
    size_t fb_pos = s_state->dma_filtered_count * buf_len;
    if (fb_pos > s_state->fb_size - buf_len)
    {
        //size_t processed = s_state->dma_received_count * buf_len;
        //ets_printf("[%s:%u] ovf pos: %u, processed: %u\n", __FUNCTION__, __LINE__, fb_pos, processed);
        return;
    }
    
    //convert I2S DMA buffer to pixel data
    (*s_state->dma_filter)(s_state->dma_buf[buf_idx], &s_state->dma_desc[buf_idx], s_state->fb->buf + fb_pos);
    
    //first frame buffer
    if (!s_state->dma_filtered_count)
    {
        //check for correct JPEG header
        if (s_state->sensor.pixformat == PIXFORMAT_JPEG)
        {
            uint32_t sig = *((uint32_t*)s_state->fb->buf) & 0xFFFFFF;
            if (sig != 0xffd8ff)
            {
                ets_printf("bh 0x%08x\n", sig);
                s_state->fb->bad = 1;
                return;
            }
        }
        //set the frame properties
        s_state->fb->width = resolution[s_state->sensor.status.framesize].width;
        s_state->fb->height = resolution[s_state->sensor.status.framesize].height;
        s_state->fb->format = s_state->sensor.pixformat;
        
        uint64_t us = (uint64_t)esp_timer_get_time();
        s_state->fb->timestamp.tv_sec = us / 1000000UL;
        s_state->fb->timestamp.tv_usec = us % 1000000UL;
    }
    s_state->dma_filtered_count++;
}

static void IRAM_ATTR dma_filter_task(void* pvParameters)
{
    s_state->dma_filtered_count = 0;
    while (true)
    {
        size_t buf_idx;
        if (xQueueReceive(s_state->data_ready, &buf_idx, portMAX_DELAY) == pdTRUE)
        {
            if (buf_idx == SIZE_MAX)
            {
                //this is the end of the frame
                dma_finish_frame();
            }
            else
            {
                dma_filter_buffer(buf_idx);
            }
        }
    }
}

