ondiiik/micropython-esp32-cam/ports/esp32/esp32-camera/driver/camera.c
    if (config->pin_reset >= 0)
    {
        MP_LOGD(TAG, "Resetting camera");
        gpio_config_t conf = { 0 };
        conf.pin_bit_mask = 1LL << config->pin_reset;
        conf.mode = GPIO_MODE_OUTPUT;
        gpio_config(&conf);
        
        gpio_set_level(config->pin_reset, 0);
        vTaskDelay(10 / portTICK_PERIOD_MS);
        gpio_set_level(config->pin_reset, 1);
        vTaskDelay(10 / portTICK_PERIOD_MS);
    }
    
    MP_LOGD(TAG, "Searching for camera address");
    vTaskDelay(10 / portTICK_PERIOD_MS);
    uint8_t slv_addr = SCCB_Probe();
    if (slv_addr == 0)
    {
        *out_camera_model = CAMERA_NONE;
        camera_disable_out_clock();
        return ESP_ERR_CAMERA_NOT_DETECTED;
    }
    
    //slv_addr = 0x30;
    MP_LOGD(TAG, "Detected camera at address=0x%02x", slv_addr);
    sensor_id_t* id = &s_state->sensor.id;
    
#if CONFIG_OV2640_SUPPORT
    if (slv_addr == 0x30)
    {
        MP_LOGD(TAG, "Resetting OV2640");
        //camera might be OV2640. try to reset it
        SCCB_Write(0x30, 0xFF, 0x01);//bank sensor
        SCCB_Write(0x30, 0x12, 0x80);//reset
        vTaskDelay(10 / portTICK_PERIOD_MS);
        slv_addr = SCCB_Probe();
    }
#endif
    
    s_state->sensor.slv_addr = slv_addr;
    s_state->sensor.xclk_freq_hz = config->xclk_freq_hz;
    
#if (CONFIG_OV3660_SUPPORT || CONFIG_OV5640_SUPPORT)
    if (s_state->sensor.slv_addr == 0x3c)
    {
        id->PID = SCCB_Read16(s_state->sensor.slv_addr, REG16_CHIDH);
        id->VER = SCCB_Read16(s_state->sensor.slv_addr, REG16_CHIDL);
        vTaskDelay(10 / portTICK_PERIOD_MS);
        MP_LOGD(TAG, "Camera PID=0x%02x VER=0x%02x", id->PID, id->VER);
    }
    else
    {
#endif
        id->PID = SCCB_Read(s_state->sensor.slv_addr, REG_PID);
        id->VER = SCCB_Read(s_state->sensor.slv_addr, REG_VER);
        id->MIDL = SCCB_Read(s_state->sensor.slv_addr, REG_MIDL);
        id->MIDH = SCCB_Read(s_state->sensor.slv_addr, REG_MIDH);
        vTaskDelay(10 / portTICK_PERIOD_MS);
        MP_LOGD(TAG, "Camera PID=0x%02x VER=0x%02x MIDL=0x%02x MIDH=0x%02x",
                 id->PID, id->VER, id->MIDH, id->MIDL);
                 
#if (CONFIG_OV3660_SUPPORT || CONFIG_OV5640_SUPPORT)
    }
#endif
    
    
    switch (id->PID)
    {
#if CONFIG_OV2640_SUPPORT
        case OV2640_PID:
            *out_camera_model = CAMERA_OV2640;
            ov2640_init(&s_state->sensor);
            break;
#endif
#if CONFIG_OV7725_SUPPORT
        case OV7725_PID:
            *out_camera_model = CAMERA_OV7725;
            ov7725_init(&s_state->sensor);
            break;
#endif
#if CONFIG_OV3660_SUPPORT
        case OV3660_PID:
            *out_camera_model = CAMERA_OV3660;
            ov3660_init(&s_state->sensor);
            break;
#endif
#if CONFIG_OV5640_SUPPORT
        case OV5640_PID:
            *out_camera_model = CAMERA_OV5640;
            ov5640_init(&s_state->sensor);
            break;
#endif
        default:
            id->PID = 0;
            *out_camera_model = CAMERA_UNKNOWN;
            camera_disable_out_clock();
            MP_LOGE(TAG, "Detected camera not supported.");
            return ESP_ERR_CAMERA_NOT_SUPPORTED;
    }
    
    MP_LOGD(TAG, "Doing SW reset of sensor");
    s_state->sensor.reset(&s_state->sensor);
    
    return ESP_OK;
}

static void camera_init(const camera_config_t* config)
{
    if (NULL == s_state)
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not initialized"));
    }
    
    if (s_state->sensor.id.PID == 0)
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not supported"));
    }
    
    memcpy(&s_state->config, config, sizeof(*config));
    esp_err_t   err        = ESP_OK;
    framesize_t frame_size = (framesize_t)config->frame_size;
    pixformat_t pix_format = (pixformat_t)config->pixel_format;
    
    switch (s_state->sensor.id.PID)
    {
#if CONFIG_OV2640_SUPPORT
        case OV2640_PID:
            if (frame_size > FRAMESIZE_UXGA)
            {
                frame_size = FRAMESIZE_UXGA;
            }
            break;
#endif
#if CONFIG_OV7725_SUPPORT
        case OV7725_PID:
            if (frame_size > FRAMESIZE_VGA)
            {
                frame_size = FRAMESIZE_VGA;
            }
            break;
#endif
#if CONFIG_OV3660_SUPPORT
        case OV3660_PID:
            if (frame_size > FRAMESIZE_QXGA)
            {
                frame_size = FRAMESIZE_QXGA;
            }
            break;
#endif
#if CONFIG_OV5640_SUPPORT
        case OV5640_PID:
            if (frame_size > FRAMESIZE_QSXGA)
            {
                frame_size = FRAMESIZE_QSXGA;
            }
            break;
#endif
        default:
            mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not supported"));
    }
    
    s_state->width  = resolution[frame_size].width;
    s_state->height = resolution[frame_size].height;
    
    if (pix_format == PIXFORMAT_GRAYSCALE)
    {
        s_state->fb_size = s_state->width * s_state->height;
        
        if ((s_state->sensor.id.PID == OV3660_PID) ||
            (s_state->sensor.id.PID == OV5640_PID))
        {
            if (is_hs_mode())
            {
                s_state->sampling_mode = SM_0A00_0B00;
                s_state->dma_filter    = &dma_filter_yuyv_highspeed;
            }
            else
            {
                s_state->sampling_mode = SM_0A0B_0C0D;
                s_state->dma_filter    = &dma_filter_yuyv;
            }
            
            s_state->in_bytes_per_pixel = 1;       // camera sends Y8
        }
        else
        {
            if (is_hs_mode() && (s_state->sensor.id.PID != OV7725_PID))
            {
                s_state->sampling_mode = SM_0A00_0B00;
                s_state->dma_filter    = &dma_filter_grayscale_highspeed;
            }
            else
            {
                s_state->sampling_mode = SM_0A0B_0C0D;
                s_state->dma_filter    = &dma_filter_grayscale;
            }
            
            s_state->in_bytes_per_pixel = 2;       // camera sends YU/YV
        }
        
        s_state->fb_bytes_per_pixel = 1;       // frame buffer stores Y8
    }
    else if ((pix_format == PIXFORMAT_YUV422) ||
             (pix_format == PIXFORMAT_RGB565))
    {
        s_state->fb_size = s_state->width * s_state->height * 2;
        if (is_hs_mode() && (s_state->sensor.id.PID != OV7725_PID))
        {
            s_state->sampling_mode = SM_0A00_0B00;
            s_state->dma_filter    = &dma_filter_yuyv_highspeed;
        }
        else
        {
            s_state->sampling_mode = SM_0A0B_0C0D;
            s_state->dma_filter    = &dma_filter_yuyv;
        }
        
