ondiiik/micropython-esp32-cam/ports/esp32/esp32-camera/driver/camera.c
    gpio_isr_handler_remove(s_state->config.pin_vsync);
    
    if (s_state->i2s_intr_handle)
    {
        esp_intr_disable(s_state->i2s_intr_handle);
        esp_intr_free(s_state->i2s_intr_handle);
    }
    
    dma_desc_deinit();
    camera_fb_deinit();
    m_free(s_state);
    s_state = NULL;
    
    camera_disable_out_clock();
    periph_module_disable(PERIPH_I2S0_MODULE);
    
    return ESP_OK;
}

#define FB_GET_TIMEOUT (4000 / portTICK_PERIOD_MS)

struct campy_FrameBuffer* esp_camera_fb_get()
{
    if (s_state == NULL)
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not initialized"));
    }
    
    if (!I2S0.conf.rx_start)
    {
        if (s_state->config.fb_count > 1)
        {
            MP_LOGD(TAG, "i2s_run");
        }
        
        if (i2s_run() != 0)
        {
            return NULL;
        }
    }
    
    bool need_yield = false;
    
    if (s_state->config.fb_count == 1)
    {
        if (xSemaphoreTake(s_state->frame_ready, FB_GET_TIMEOUT) != pdTRUE)
        {
            i2s_stop(&need_yield);
            MP_LOGE(TAG, "Failed to get the frame on time!");
            return NULL;
        }
        return (struct campy_FrameBuffer*)s_state->fb;
    }
    
    struct campy_FrameBuffer* fb = NULL;
    
    if (s_state->fb_out)
    {
        if (xQueueReceive(s_state->fb_out, &fb, FB_GET_TIMEOUT) != pdTRUE)
        {
            i2s_stop(&need_yield);
            MP_LOGE(TAG, "Failed to get the frame on time!");
            return NULL;
        }
    }
    
    return fb;
}

void esp_camera_fb_return(struct campy_FrameBuffer* fb)
{
    if (fb == NULL || s_state == NULL || s_state->config.fb_count == 1 || s_state->fb_in == NULL)
    {
        return;
    }
    xQueueSend(s_state->fb_in, &fb, portMAX_DELAY);
}

sensor_t* esp_camera_sensor_get()
{
    if (s_state == NULL)
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not initialized"));
    }
    
    return &s_state->sensor;
}

esp_err_t esp_camera_save_to_nvs(const char* key)
{
#if ESP_IDF_VERSION_MAJOR > 3
    nvs_handle_t handle;
#else
    nvs_handle handle;
#endif
    esp_err_t ret = nvs_open(key, NVS_READWRITE, &handle);
    
    if (ret == ESP_OK)
    {
        sensor_t* s = esp_camera_sensor_get();
        if (s != NULL)
        {
            ret = nvs_set_blob(handle, CAMERA_SENSOR_NVS_KEY, &s->status, sizeof(camera_status_t));
            if (ret == ESP_OK)
            {
                uint8_t pf = s->pixformat;
                ret = nvs_set_u8(handle, CAMERA_PIXFORMAT_NVS_KEY, pf);
            }
            return ret;
        }
        else
        {
            return ESP_ERR_CAMERA_NOT_DETECTED;
        }
        nvs_close(handle);
        return ret;
    }
    else
    {
        return ret;
    }
}

esp_err_t esp_camera_load_from_nvs(const char* key)
{
#if ESP_IDF_VERSION_MAJOR > 3
    nvs_handle_t handle;
#else
    nvs_handle handle;
#endif
    uint8_t pf;
    
    esp_err_t ret = nvs_open(key, NVS_READWRITE, &handle);
    
    if (ret == ESP_OK)
    {
        sensor_t* s = esp_camera_sensor_get();
        camera_status_t st;
        if (s != NULL)
        {
            size_t size = sizeof(camera_status_t);
            ret = nvs_get_blob(handle, CAMERA_SENSOR_NVS_KEY, &st, &size);
            if (ret == ESP_OK)
            {
                s->set_ae_level(s, st.ae_level);
                s->set_aec2(s, st.aec2);
                s->set_aec_value(s, st.aec_value);
                s->set_agc_gain(s, st.agc_gain);
                s->set_awb_gain(s, st.awb_gain);
                s->set_bpc(s, st.bpc);
                s->set_brightness(s, st.brightness);
                s->set_colorbar(s, st.colorbar);
                s->set_contrast(s, st.contrast);
                s->set_dcw(s, st.dcw);
                s->set_denoise(s, st.denoise);
                s->set_exposure_ctrl(s, st.aec);
                s->set_framesize(s, st.framesize);
                s->set_gain_ctrl(s, st.agc);
                s->set_gainceiling(s, st.gainceiling);
                s->set_hmirror(s, st.hmirror);
                s->set_lenc(s, st.lenc);
                s->set_quality(s, st.quality);
                s->set_raw_gma(s, st.raw_gma);
                s->set_saturation(s, st.saturation);
                s->set_sharpness(s, st.sharpness);
                s->set_special_effect(s, st.special_effect);
                s->set_vflip(s, st.vflip);
                s->set_wb_mode(s, st.wb_mode);
                s->set_whitebal(s, st.awb);
                s->set_wpc(s, st.wpc);
            }
            ret = nvs_get_u8(handle, CAMERA_PIXFORMAT_NVS_KEY, &pf);
            if (ret == ESP_OK)
            {
                s->set_pixformat(s, pf);
            }
        }
        else
        {
            return ESP_ERR_CAMERA_NOT_DETECTED;
        }
        nvs_close(handle);
        return ret;
    }
    else
    {
        MP_LOGW(TAG, "Error (%d) opening nvs key \"%s\"", ret, key);
        return ret;
    }
}


/*
 * See description with declaration
 */
extern struct campy_Camera* campy_Camera_new(const camera_config_t* aConfig)
{
    struct campy_Camera* self = m_new_obj(struct campy_Camera);
    
    self->base.type = &MP_NAMESPACE2(campy, Camera);
    memcpy(&(self->config), aConfig, sizeof(self->config));
    
    return self;
}


/*
 * See description with declaration
 */
struct campy_FrameBuffer* campy_FrameBuffer_new(unsigned    aWidth,
                                                unsigned    aHeight,
                                                pixformat_t aPixFirmat,
                                                const byte* aData,
                                                size_t      aLen)
{
    if (NULL == s_state)
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Camera not initialized"));
    }
    
    if (aLen > s_state->fb_size)
    {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("Data too large to be stored into buffer"));
    }
    
    struct campy_FrameBuffer* self = m_new_obj(struct campy_FrameBuffer);
    
    self->base.type         = &MP_NAMESPACE2(campy, FrameBuffer);
    self->buf               = (uint8_t*)m_malloc(s_state->fb_size);
    self->len               = aLen;
    self->width             = aWidth;
    self->height            = aHeight;
    self->format            = aPixFirmat;
    self->timestamp.tv_sec  = 0;
    self->timestamp.tv_usec = 0;
    
    memcpy(self->buf, aData, aLen);
    
    return self;
}
